Revit 2026 API

# RebarSpliceUtilsGetSpliceGeometries Method

---

Computes a list of RebarSpliceGeometry which respects the rules. This list can be used to splice the Rebar.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RebarSpliceByRulesResult GetSpliceGeometries(
	Document document,
	ElementId rebarIdToSplit,
	RebarSpliceOptions spliceOptions,
	RebarSpliceRules spliceRules
)
```
```vb
Public Shared Function GetSpliceGeometries (
	document As Document,
	rebarIdToSplit As ElementId,
	spliceOptions As RebarSpliceOptions,
	spliceRules As RebarSpliceRules
) As RebarSpliceByRulesResult
```
```cpp
public:
static RebarSpliceByRulesResult^ GetSpliceGeometries(
	Document^ document,
	ElementId^ rebarIdToSplit,
	RebarSpliceOptions^ spliceOptions,
	RebarSpliceRules^ spliceRules
)
```
```fsharp
static member GetSpliceGeometries :
        document : Document *
        rebarIdToSplit : ElementId *
        spliceOptions : RebarSpliceOptions *
        spliceRules : RebarSpliceRules -> RebarSpliceByRulesResult
```

#### Parameters

document Document
     The document
rebarIdToSplit ElementId
     Rebar id to split.
spliceOptions RebarSpliceOptions
     The rebar splice options.
spliceRules RebarSpliceRules
     The splice rules.

#### Return Value

RebarSpliceByRulesResult Returns the result of the operation. If the operation was successful the RebarSpliceByRulesResult.Error member will have "RebarSpliceByRulesError.Success" value.

| Exception | Condition |
| --- | --- |
| ArgumentException | RebarSplicePosition should be Middle. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RebarSpliceUtils Class

Autodesk.Revit.DB.Structure Namespace